package com.neuedu.chapter07.抽象类;
/**
	抽象类：是抽象方法与非抽象方法的集合
	
		语法：
			<修饰符> abstract class 抽象类名
			{
				抽象方法;
				非抽象方法;
			}
		  
		    两种特殊情况：
		    1.类中全部是抽象方法
		    2.类中全部是非抽象方法（意义不大）

		 注意：
		 	1.抽象类不能被实例化
		 	2.父类的所有抽象方法必须在子类中提供具体实现，否则子类只能被声明为抽象类
		 	3.抽象方法不能为static
		 	
		 注意以下两种情况，一个类必须声明为抽象类：
		 	1.当类中存在一个或多个抽象方法时
		 	2.当子类没有父类的所有抽象方法提供具体实现时，子类必须被声明为抽象类
		 	
------------------------------------------------------------------
           抽象方法：只有方法声明，没有具体实现
                          语法：
          	<修饰符> abstract 返回值类型   抽象方法名([参数列表]);
 */
//抽象类
public abstract class AbstractClass {

	//抽象方法：总父类：可乐公司员工的计算薪资的方法
	public abstract void getSalary(int month);
	
	//非抽象方法
	public void getDetail()
	{
		System.out.println("个人信息展示");
	}
	
}
